{
  "appName": {
    "message": "Caret Browsing",
    "description": "The title of the application, displayed in the web store."
  },
  "appDesc": {
    "message": "Browse the text of web pages using arrow keys.",
    "description":"The description of the application, displayed in the web store."
  },
  "caretBrowsingOptions": {
    "message": "Caret Browsing Options",
    "description": "The title of the options page."
  },
  "subheading1": {
    "message": "This extension gives you a movable cursor in the web page, allowing you to select text with the keyboard.",
    "description": "Text at the top of the options page explaining the extension."
  },
  "subheading2": {
    "message": "Try it out now - Caret Browsing is always enabled on this page!",
    "description": "More text at the top of the options page, explaining that Caret Browsing (the name of this extension) is enabled on this page and the user can try it."
  },
  "keyboardCommands": {
    "message": "Keyboard Commands",
    "description": "Title of the heading on the page that describes keyboard commands."
  },
  "enableDisableNonCros": {
    "message": "Press <span class='key'>F7</span> to turn on Caret Browsing. Press it again to turn it off.",
    "description": "Instructions for how to enable or disable this feature on any platform other than Chrome OS."
  },
  "enableDisableCros": {
    "message": "Press <span class='key'>Search</span> + <img src='increase_brightness.png'> (the Increase Brightness key, or F7) to turn on Caret Browsing. Press it again to turn it off.",
    "description": "Instructions for how to enable or disable this feature on a Chromebook, where you have to hold Search and press the special Increase Brightness key on the top of the keyboard, or F7 if you're using an alternate keyboard."
  },
  "moveByWordsNonMac": {
    "message": "Hold down <span class='key'>Control</span> to move by words.",
    "description": "Text that describes how to move by words using the Control key. This string is used on all platforms other than Mac."
  },
  "moveByWordsMac": {
    "message": "Hold down <span class='key'>Option</span> to move by words.",
    "description": "Text that describes how to move by words using the Option key on a Mac keyboard."
  },
  "visualFeedback": {
    "message": "Visual Feedback",
    "description": "Heading text for the part of the options page that lets the user choose options for how the caret is shown visually."
  },
  "whenEnabled": {
    "message": "When Caret Browsing is enabled:",
    "description": "Subheading in the options page where the user chooses what to show visually when this feature (Caret Browsing) is enabled."
  },
  "animation": {
    "message": "Highlight the cursor position with an animation.",
    "description": "One of several possible options for what to do when the cursor first appears - this option is to show a quick animation."
  },
  "flash": {
    "message": "Highlight the cursor position with a quick flash.",
    "description": "One of several possible options for what to do when the cursor first appears - this option is to flash something quickly."
  },
  "noFeedback": {
    "message": "No feedback, just show the cursor.",
    "description": "One of several possible options for what to do when the cursor first appears - this option is to do nothing."
  },
  "jump": {
    "message": "When the caret jumps by a large distance:",
    "description": "Subheading in the options page where the user chooses what to show visually when the cursor jumps from one part of the page to another part that's far away."
  },
  "navHelp": {
    "message": "<p>Use arrow keys to move throughout the document. </p><p>Click anywhere to move the cursor to that location. </p> <p>   Press <span class='key'>Shift</span> + arrows to select text.</p>",
    "description": "A description of how to use the caret browsing feature."
  },
  "focusHelp": {
    "message": "<p>When you reach a link or control, it is automatically focused.   Press <span class='key'>Enter</span> to click a link or button. </p> <p>   When a focused control (like a text box or a list box) is capturing   arrow keys, press <span class='key'>Esc</span> followed by the   left or right arrow to continue Caret Browsing. </p> <p>   Alternatively, press <span class='key'>Tab</span> to move to the   next focusable control. </p>",
    "description": "A description of how to use the caret browsing feature to navigate between focusable controls like text fields."
  }
}
